import java.io.*;

public class data {
  public static final String sa[] = {
  "Республика Адыгея",
  "Республика Башкортостан",
  "Республика Бурятия",
  "Республика Горный Алтай",
  "Республика Дагестан",
  "Ингушская республика",
  "Кабардино-Балкарская Республика",
  "Республика Калмыкия",
  "Карачаево-Черкесская Республика",
  "Республика Карелия",
  "Республика Коми",
  "Республика Марий-Эл",
  "Мордовская республика",
  "Республика Саха (Якутия)",
  "Северо-Осетинская Республика",
  "Республика Татарстан",
  "Республика Тува",
  "Удмуртская Республика",
  "Республика Хакасия",
  "Чеченская Республика",
  "Чувашская Республика",
  "Алтайский край",
  "Краснодарский край",
  "Красноярский край",
  "Приморский край",
  "Ставропольский край",
  "Хабаровский край",
  "Амурская область",
  "Архангельская область",
  "Астраханская область",
  "Белгородская область",
  "Брянская область",
  "Владимирская область",
  "Волгоградская область",
  "Вологодская область",
  "Воронежская область",
  "Ивановская область",
  "Иркутская область",
  "Калининградская область",
  "Калужская область",
  "Камчатская область",
  "Кемеровская область",
  "Кировская область",
  "Костромская область",
  "Курганская область",
  "Курская область",
  "Ленинградская область",
  "Липецкая область",
  "Магаданская область",
  "Московская область",
  "Мурманская область",
  "Нижегородская область",
  "Новгородская область",
  "Новосибирская область",
  "Омская область",
  "Оренбургская область",
  "Орловская область",
  "Пензенская область",
  "Пермская область",
  "Псковская область",
  "Ростовская область",
  "Рязанская область",
  "Самарская область",
  "Саратовская область",
  "Сахалинская область",
  "Свердловская область",
  "Смоленская область",
  "Тамбовская область",
  "Тверская область",
  "Томская область",
  "Тульская область",
  "Тюменская область",
  "Ульяновская область",
  "Челябинская область",
  "Читинская область",
  "Ярославская область",
  "Москва",
  "Санкт-Петербург",
  "Еврейская автономная область",
  "Агинский Бурятский АО",
  "Коми-Пермяцкий АО",
  "Корякский автономный округ",
  "Ненецкий автономный округ",
  "Таймырский автономный округ",
  "Усть-Ордынский Бурятский АО",
  "Ханты-Мансийский АО",
  "Чукотский автономный округ",
  "Эвенский автономный округ",
  "Ямало-Ненецкий АО"
  };

  public String getInfo(String regindex) {
    InputStream is;
    DataInputStream dis;
    int startbyte=3;
    ByteArrayOutputStream baos;
    String s;
    int b;
    byte abyte[];
    int len;

    b = 0;
    is = getClass().getResourceAsStream(regindex+".txt");
    try {
      is.skip(startbyte);
      baos = new ByteArrayOutputStream();
      baos.write(0);
      baos.write(0);
      while ((b=is.read())!=-1) {
        baos.write(b);
      }
      abyte = baos.toByteArray();
      len = abyte.length - 2;
      abyte[0] = (byte) (len >> 8 & 0xff);
      abyte[1] = (byte) (len & 0xff);
      baos.close();
      dis = new DataInputStream(new ByteArrayInputStream(abyte));
      s = dis.readUTF();
      dis.close();
      is.close();
      return s;
    }
    catch (Exception e) {
      e.printStackTrace();
    }
    return "...";
  }
}
